In [1]:
import pandas as pd

In [6]:
a=pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
a.index=["preethi","raju","vanitha","vinay"]
a

preethi    1
raju       2
vanitha    3
vinay      4
dtype: int64

In [17]:
a=pd.Series(["mango","banana","apple","kiwi"])
a.index=["one","two","three","four"]
a

one       mango
two      banana
three     apple
four       kiwi
dtype: object

In [18]:
a=pd.Series(a,index=["one","two","three","four"])
a

one       mango
two      banana
three     apple
four       kiwi
dtype: object

In [19]:
a=pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [24]:
a=pd.Series({"name":"preethi","age":23,"USN":"4ra22cs079","course":"Datascience"})
a

name          preethi
age                23
USN        4ra22cs079
course    Datascience
dtype: object

In [25]:
a=pd.Series((1,2,3,4))
a

0    1
1    2
2    3
3    4
dtype: int64

In [32]:
a=pd.Series([{1,2,3,1,1,1,1}])
print(a.dtype)

object

In [38]:
a=pd.Series(7)
a

0    7
dtype: int64

In [39]:
a=pd.Series(7,index=[1,2,3,4,5,6])
a

1    7
2    7
3    7
4    7
5    7
6    7
dtype: int64

In [40]:
a=pd.Series(3)
a

0    3
dtype: int64

In [43]:
a=pd.Series(5,index=[1,2,3,4,5,6,7])
a

1    5
2    5
3    5
4    5
5    5
6    5
7    5
dtype: int64

In [45]:
a=pd.Series("preethi",index=[1,2,3,4,5,6,7,8,9,10])
a

1     preethi
2     preethi
3     preethi
4     preethi
5     preethi
6     preethi
7     preethi
8     preethi
9     preethi
10    preethi
dtype: object

In [46]:
a=pd.Series(True,index=[1,2,3,4,5,6,7])
a

1    True
2    True
3    True
4    True
5    True
6    True
7    True
dtype: bool

In [48]:
a=pd.Series(3.4,index=[1,2,3,4,5,6])
a

1    3.4
2    3.4
3    3.4
4    3.4
5    3.4
6    3.4
dtype: float64

In [50]:
a=pd.Series(2,index=range(10))
a

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
8    2
9    2
dtype: int64

In [51]:
a=pd.Series(5,index=range(8))
a

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
dtype: int64

In [52]:
a=pd.Series("Grade=A",index=range(16))
a

0     Grade=A
1     Grade=A
2     Grade=A
3     Grade=A
4     Grade=A
5     Grade=A
6     Grade=A
7     Grade=A
8     Grade=A
9     Grade=A
10    Grade=A
11    Grade=A
12    Grade=A
13    Grade=A
14    Grade=A
15    Grade=A
dtype: object

In [54]:
a=pd.Series([1,2,3,4])
print(a[0])

1

In [55]:
print(a[2])

3

In [57]:
a=pd.Series([1,2,3,4,5])
a.index=["one","two","three","four","five"]
a

one      1
two      2
three    3
four     4
five     5
dtype: int64

In [59]:
print(a["one"])

1

In [61]:
print(a["two"])

2

In [63]:
print(a[["one","two"]])

one    1
two    2
dtype: int64

In [65]:
print(a[["one","three"]])

one      1
three    3
dtype: int64

In [66]:
a=pd.Series([1,2,3,4])
print(a[0])

1

In [69]:
a.index=["one","two","three","four"]
a

one      1
two      2
three    3
four     4
dtype: int64

In [73]:
print(a.loc["one"])

1

In [75]:
a.index=[11,12,13,14]
a

11    1
12    2
13    3
14    4
dtype: int64

In [77]:
print(a.loc[13])

3

In [78]:
print(a[1])

KeyError: 1

In [80]:
a=pd.Series([1,2,3,4,5])
a.index=["a","b","c","d","e"]
a

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [83]:
print(a.iloc[0])

1

In [85]:
a=pd.Series([30,40,50,10,20,60,8])
print(a[a>10])

0    30
1    40
2    50
4    20
5    60
dtype: int64

In [89]:
a.get(5)

np.int64(60)

In [92]:
a=pd.DataFrame({
    "name":["preethi","raju","vanitha","vinay"],
    "age":[18,19,21,24]
    })
a

      name  age
0  preethi   18
1     raju   19
2  vanitha   21
3    vinay   24

In [97]:
a.drop("name",axis=1)

   age
0   18
1   19
2   21
3   24

In [99]:
s=pd.Series([1,2,3,4,5,6])
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [102]:
s.drop(3,axis=0)

0    1
1    2
2    3
4    5
5    6
dtype: int64

In [105]:
a=pd.DataFrame({
    "name":["preethi","raju","vanitha","vinay"],
    "age":[24,22,21,12],
    "usn":["4ra22cs079","4ra22cs99","4racs77","4ra22cs076"],
    "marks":[99,77,88,45]
})
a

      name  age         usn  marks
0  preethi   24  4ra22cs079     99
1     raju   22   4ra22cs99     77
2  vanitha   21     4racs77     88
3    vinay   12  4ra22cs076     45

In [106]:
a.drop("age",axis=1)

      name         usn  marks
0  preethi  4ra22cs079     99
1     raju   4ra22cs99     77
2  vanitha     4racs77     88
3    vinay  4ra22cs076     45

In [107]:
a

      name  age         usn  marks
0  preethi   24  4ra22cs079     99
1     raju   22   4ra22cs99     77
2  vanitha   21     4racs77     88
3    vinay   12  4ra22cs076     45

In [110]:
c=a.copy()
c

      name  age         usn  marks
0  preethi   24  4ra22cs079     99
1     raju   22   4ra22cs99     77
2  vanitha   21     4racs77     88
3    vinay   12  4ra22cs076     45

In [111]:
a.drop("age" ,axis=1,inplace=True)

In [112]:
a

      name         usn  marks
0  preethi  4ra22cs079     99
1     raju   4ra22cs99     77
2  vanitha     4racs77     88
3    vinay  4ra22cs076     45

In [114]:
a.drop(2,axis=0,inplace=True)

In [115]:
a

      name         usn  marks
0  preethi  4ra22cs079     99
1     raju   4ra22cs99     77
3    vinay  4ra22cs076     45

In [116]:
c

      name  age         usn  marks
0  preethi   24  4ra22cs079     99
1     raju   22   4ra22cs99     77
2  vanitha   21     4racs77     88
3    vinay   12  4ra22cs076     45

In [117]:
c.head(2)

      name  age         usn  marks
0  preethi   24  4ra22cs079     99
1     raju   22   4ra22cs99     77

In [118]:
c.tail(3)

      name  age         usn  marks
1     raju   22   4ra22cs99     77
2  vanitha   21     4racs77     88
3    vinay   12  4ra22cs076     45

In [120]:
c.columns

Index(['name', 'age', 'usn', 'marks'], dtype='object')

In [121]:
c.columns

Index(['name', 'age', 'usn', 'marks'], dtype='object')

In [122]:
c.name

0    preethi
1       raju
2    vanitha
3      vinay
Name: name, dtype: object

In [123]:
c.age

0    24
1    22
2    21
3    12
Name: age, dtype: int64

In [124]:
c["name"]

0    preethi
1       raju
2    vanitha
3      vinay
Name: name, dtype: object

In [126]:
c.age

(0    preethi
 1       raju
 2    vanitha
 3      vinay
 Name: name, dtype: object,
 0    24
 1    22
 2    21
 3    12
 Name: age, dtype: int64)

In [127]:
c

      name  age         usn  marks
0  preethi   24  4ra22cs079     99
1     raju   22   4ra22cs99     77
2  vanitha   21     4racs77     88
3    vinay   12  4ra22cs076     45

In [128]:
c.sort_values("name")

      name  age         usn  marks
0  preethi   24  4ra22cs079     99
1     raju   22   4ra22cs99     77
2  vanitha   21     4racs77     88
3    vinay   12  4ra22cs076     45

In [129]:
c.sort_values("age")

      name  age         usn  marks
3    vinay   12  4ra22cs076     45
2  vanitha   21     4racs77     88
1     raju   22   4ra22cs99     77
0  preethi   24  4ra22cs079     99

In [131]:
c.sort_values("age",ascending=False)

      name  age         usn  marks
0  preethi   24  4ra22cs079     99
1     raju   22   4ra22cs99     77
2  vanitha   21     4racs77     88
3    vinay   12  4ra22cs076     45

In [139]:
c["age"]=c["age"]+5
c

      name  age         usn  marks
0  preethi   39  4ra22cs079     99
1     raju   37   4ra22cs99     77
2  vanitha   36     4racs77     88
3    vinay   27  4ra22cs076     45

In [145]:
c["marks"]=c["marks"]+4
c

      name  age         usn  marks
0  preethi   39  4ra22cs079    111
1     raju   37   4ra22cs99     89
2  vanitha   36     4racs77    100
3    vinay   27  4ra22cs076     57

In [147]:
c.loc[2,"name"]="sahana"
c

      name  age         usn  marks
0  preethi   39  4ra22cs079    111
1     raju   37   4ra22cs99     89
2   sahana   36     4racs77    100
3    vinay   27  4ra22cs076     57

In [150]:
print(c.loc[2,"age"])

36

In [164]:
c.loc[2,"marks"]=None
c

      name  age         usn marks
0  preethi   39  4ra22cs079   111
1     raju   37   4ra22cs99    89
2   sahana   36     4racs77  None
3    vinay   27  4ra22cs076    57

In [167]:
import numpy as np
c.loc[2,"marks"]=np.nan

In [168]:
c

      name  age         usn marks
0  preethi   39  4ra22cs079   111
1     raju   37   4ra22cs99    89
2   sahana   36     4racs77   NaN
3    vinay   27  4ra22cs076    57

In [169]:
c.isna()

    name    age    usn  marks
0  False  False  False  False
1  False  False  False  False
2  False  False  False   True
3  False  False  False  False

In [170]:
c.isna().sum()

name     0
age      0
usn      0
marks    1
dtype: int64

In [172]:
c.isna().any()

name     False
age      False
usn      False
marks     True
dtype: bool

In [174]:
c.isna().sum().sum()

np.int64(1)

In [228]:
a=pd.DataFrame({
    "name":["a","b","c","d"],
    "marks":[99,55,33,22]
})
a

  name  marks
0    a     99
1    b     55
2    c     33
3    d     22

In [229]:
a["marks"]=a["marks"]+1

In [230]:
a

  name  marks
0    a    100
1    b     56
2    c     34
3    d     23

In [231]:
a["marks"]=a["marks"].apply(lambda x:x+2)
a

  name  marks
0    a    102
1    b     58
2    c     36
3    d     25

In [232]:
a

  name  marks
0    a    102
1    b     58
2    c     36
3    d     25

In [233]:
a["result"]=a["marks"].apply(lambda x:"pass" if x>30 else "fail")

In [210]:
a

  name  marks result
0    a    102   pass
1    b     58   pass
2    c     36   pass
3    d     25   fail

In [236]:
a["status"]=["","","",""]
a

  name  marks result status
0    a    102   pass
1    b     58   pass
2    c     36   pass
3    d     25   fail

In [246]:
a["ststus"]=a["result"].apply(lambda x:"high" if x=="pass" else "low")

In [7]:
a

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.5,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,6840-RESVB,Male,0,Yes,Yes,24,Yes,Yes,DSL,Yes,...,Yes,Yes,Yes,Yes,One year,Yes,Mailed check,84.80,1990.5,No
7039,2234-XADUH,Female,0,Yes,Yes,72,Yes,Yes,Fiber optic,No,...,Yes,No,Yes,Yes,One year,Yes,Credit card (automatic),103.20,7362.9,No
7040,4801-JZAZL,Female,0,Yes,Yes,11,No,No phone service,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.60,346.45,No
7041,8361-LTMKD,Male,1,Yes,No,4,Yes,Yes,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Mailed check,74.40,306.6,Yes
7042,3186-AJIEK,Male,0,No,No,66,Yes,No,Fiber optic,Yes,...,Yes,Yes,Yes,Yes,Two year,Yes,Bank transfer (automatic),105.65,6844.5,No

In [6]:
import pandas as pd
a=pd.read_csv("preethi.csv")
a

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.5,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,6840-RESVB,Male,0,Yes,Yes,24,Yes,Yes,DSL,Yes,...,Yes,Yes,Yes,Yes,One year,Yes,Mailed check,84.80,1990.5,No
7039,2234-XADUH,Female,0,Yes,Yes,72,Yes,Yes,Fiber optic,No,...,Yes,No,Yes,Yes,One year,Yes,Credit card (automatic),103.20,7362.9,No
7040,4801-JZAZL,Female,0,Yes,Yes,11,No,No phone service,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.60,346.45,No
7041,8361-LTMKD,Male,1,Yes,No,4,Yes,Yes,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Mailed check,74.40,306.6,Yes
7042,3186-AJIEK,Male,0,No,No,66,Yes,No,Fiber optic,Yes,...,Yes,Yes,Yes,Yes,Two year,Yes,Bank transfer (automatic),105.65,6844.5,No